#!/bin/bash
#b1=('0.33' '1.92' '0.7' '-1' '0.5' '2' '-1' '0.5' '-2' '9')
#b2=('0.33' '-1.34' '0.7' '1' '0.25' '2' '-2' '7' '-5' '9')
#b3=('0.33' '0.42' '-0.4' '1' '0.25' '2' '-3' '-1' '3' '6')

# b1=('-3' '4' '3' '-3' '-2.5' '3.5' '2.5' '-2.5' '-2' '3' '2' '-2' '-1.5' '2.5' '1.5' '-1.5' '-1' '2' '1' '-1' '-3' '3')
# b2=('4' '-3' '4' '-4' '3.5' '-2.5' '3.5' '-3.5' '3' '-2' '3' '-3' '2.5' '-1.5' '2.5' '-2.5' '2' '-1' '2' '-2' '-2' '2')
# b1=('-3' '3')
# b2=('4' '4')
b1=('-2' '2' '-2' '3' '-3' '3' '2' '2' '-2' '4' '4' '4')
b2=('5' '5' '-5' '-6' '-6' '6' '-1.5' '1.5' '-1.5' '-2' '2')
b3=('-2' '2' '-2' '4' '-4' '4' '0.5' '0.5' '-0.5' '-1' '1')
# b1=('1' '-1' '0.8' '0.6' '0.4' '0.2' '-0.8' '-0.6' '-0.4' '-0.2')
a0=('1' '0.3')
tao=('1' '0.8' '0.6' '0.4' '0.2')
env='pt37_backup'
lr=0.1
bs=128
epoch=160 #160


model=('rx29_2' 'ab1rx29_2' )
# model=('ab1rx29_2' 'ab1rx29_4' 'ab1rx29_8' 'ab1rx29_32')
# model=('ab2rx29_2' 'ab2rx29_4' 'ab2rx29_8' 'ab2rx29_32')
# model=('ab3rx29_2' 'ab3rx29_4' 'ab3rx29_8' 'ab3rx29_32')




dir_loc='6.21'
device='9'
train_dir='train_orix.py' #train_ori1.py

for ((h=0;h<1;h++));do #tao 步
    for ((l=0;l<1;l++));do #a0 系数
        for ((k=0;k<1;k++));do #b1,b2,b3系数
            for ((i=1;i<2;i++));do #模型
                for ((j=0;j<1;j++));do #重复实验次数
                    k1=`echo "scale=4;${tao[h]}*${b1[k]}"|bc`
                    k2=`echo "scale=4;${tao[h]}*${b2[k]}"|bc`
                    k3=`echo "scale=4;${tao[h]}*${b3[k]}"|bc`
                    CUDA_VISIBLE_DEVICES=${device} nohup /home/lab416/anaconda3/envs/pt37_backup/bin/python ${train_dir} --repnum ${j} --nnlayer ${i} --tao ${k} --epoch ${epoch} -bs ${bs} --lr ${lr} --a0 ${a0[l]} --arch ${model[i]} > ./log/${dir_loc}/tao_${tao[h]}_a0_${a0[l]}_${model[i]}_${j}.txt 2>&1
                done;
            done;
        done;
    done;
done;





